src/main/java/com/xavier/webservices/upandrunning/ch03/fibcsoap12/rcs12.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://ch03.fib" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ch03.fib" name="RabbitCounterSOAP12Service">
<types>
<xsd:schema>
<xsd:import namespace="http://ch03.fib" schemaLocation="http://localhost:8888/rcs12?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="countRabbits">
<part name="parameters" element="tns:countRabbits"></part>
</message>
<message name="countRabbitsResponse">
<part name="parameters" element="tns:countRabbitsResponse"></part>
</message>
<message name="FibException">
<part name="fault" element="tns:FibException"></part>
</message>
<portType name="RabbitCounterSOAP12">
<operation name="countRabbits">
<input wsam:Action="http://ch03.fib/RabbitCounterSOAP12/countRabbitsRequest" message="tns:countRabbits"></input>
<output wsam:Action="http://ch03.fib/RabbitCounterSOAP12/countRabbitsResponse" message="tns:countRabbitsResponse"></output>
<fault message="tns:FibException" name="FibException" wsam:Action="http://ch03.fib/RabbitCounterSOAP12/countRabbits/Fault/FibException"></fault>
</operation>
</portType>
<binding name="RabbitCounterSOAP12PortBinding" type="tns:RabbitCounterSOAP12">
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap12:binding>
<operation name="countRabbits">
<soap12:operation soapAction=""></soap12:operation>
<input>
<soap12:body use="literal"></soap12:body>
</input>
<output>
<soap12:body use="literal"></soap12:body>
</output>
<fault name="FibException">
<soap12:fault name="FibException" use="literal"></soap12:fault>
</fault>
</operation>
</binding>
<service name="RabbitCounterSOAP12Service">
<port name="RabbitCounterSOAP12Port" binding="tns:RabbitCounterSOAP12PortBinding">
<soap12:address location="http://localhost:8888/rcs12"></soap12:address>
</port>
</service>
</definitions>